Update mermaid diagram for more explanation
